#შექმენით პროგრამა სადაც მომხმარებელი შემოიტანს 5 რციხვს, ხოლო ამ 5 რიცხვს შორის გამოიყენეთ ყველა არითმეტიკული ოპერაცია (+,-,*,/,%,//), საბოლოოდ დაბეჭდეთ შედეგები ტერმინალში + ახსენით თითოეული ნაწილი კოდის რატომ დაწერეთ კონკრეტული ხაზი და რას აკეთებს.

num_1 = int(input("enter random number:")) # აქ ჩვენ შევქმენით ცვლადი სადაც მომხმარებელი შემოიტანს სასურველ რიცხვს
num_2 = int(input("enter random number:")) #აქაც იგივე როგორც 3 ხაზზე უბრალოდ აქ მომხმარებელს შემოაქვს მეორე რიცხვი


sum = num_1 + num_2 #აქ ხდება მომხმარებლის პირევლი რიცხვის მეორეხე მიმატება
deduction = num_1 - num_2 #აქ კი მომხმარებლის პირველი რიცხვის მეორზე გამოკლება
multiplication = num_1 * num_2 #აქ პირველი რიცხვი მრავლდება მეორეზე
float = num_1 / num_2 #აქ პირველი რიცხვი იყოფა მეორეზე უბრალოდ გვიჩვენებს როგორც ათწილადს
division = num_1 // num_2 # აქ ხდება ჩვეულებრივი გაყოფა
percent = num_1 % num_2 # ეს კოდი კი გვიჩვენებს თუ რა დარჩება ნაშთი როცა პირველ რიცხვს გავყოფთ მეორეზე

print(sum)
print(deduction)
print(multiplication)
print(float)
print(division)
print(percent)