print("ორივე არხი გამოწერილია და ყველა ვიდეო დალაიქებულია")

print("გავიცანი და დავუმეგობრდი:ანდრია ქორჩილავას და ანასტასია ხვედელიეს")

print("გოა არის საუკეთესო აკადემია საქართველოში რომელიც სულ მალე არამარტო საქართველოში არამედ მსოფლიოშიც საუკეთესო იქნება სულ მალე.GOA არის მიზნებზე ორიენტირებული აკადემია,სადაც დაისახავ დიდი მიზნებს და ყველა მოგეხმარება ამ მიზნების მიღწევაში.აქ არის ოჯახური გარემო და დიდი პატივისცემა ერთმანეთს მიმართ ამაში შემოსვლისთანავე დარწმუნდებით.აქ არიან რაზმის ლიდერები რომლებიც ცდილობენ გაგიზიარონ თავისი ცოდნა და გამოცდილება.პროგრამირების გარდა აქ ისწავლება:ზრდილობა,კაცობა,და უნარები რომლებიც მთელი ცხოვრების მანძილზე გამოგვადგება.პირადად მე ჯერ ერთ გაკვეთილს დავესწარი და გაოგნებული ვარ ისეთი კარგი გარემო და აურააა.მინდა მადლობა გადავუხადო ბატონ ნიკა კეშელავას ასეთი შესაძლებლობიშთვის და GOAს დაარსებისთვის.ასევე მადლობა მინდა გადავუხადო  ჩემი რაზმის ლიდერს მათ გიორგელაშვილს.")





