 1car=merceddes (car="mercedes")
#მოდი ავხსან ჩადურად თუ რატომ გვიჩვენებს ერორს. ჩვენ გვინდა შევმნათ string ტიპის ცვლადი ამისთვის საჭიროა გამოვიყენოთ ბრჭყალეები რაც ჩვენ არგაგვითვალისწინებია.სწორედ ამიტომ აჩვენებს ერორს.გვერძე მას უწერია სწორი ფორმა
1name="giorgi"
age=14
print(name+age) print(name+str(age))
#ჩვენ არშეგვიძლია პირდაპირ string მივუმატოთ integer იმიტომ რომ ისინი ერთმანეთისგან განსხვავდებიან.სწორი ფორმა გვერძე გვიწერია.ასე შეგვიძლია strings მივუმატოთ integoer
1name:"giorgi" name="giorgi"
#იმისათის რომ ჩვენ შევქმნათ ცვლადი და დავაკავშიროთ ერთმანეთთან საჭიროა ტოლობის გამოყენება ჩვენ კიდევ გამოყენებული გვაქვს გაყოფის ნიშანი რაც შესაბამისად გამოიტანს ერორს
printname
#იმისათვის რომ ჩვენ დავპრინტოთ სახელი საჭიროა სახელის პრჩხილებში მოქცევა რაც ჩვენ არგვაქვს გაკეთებული უპროსწორად ერთი ფრჩხილი გამოტოვებული გვაქვს ამიტომ გამოიტანა ერორი
1account balance=500 account_balance=500
#აქაც გამოიტანა ერორი.ცვენ გვინდა ეს ორი სიტყვა დავაკავშიროთ ერთმანეთთან ამისათვის საჭიროა გამოვიყენოთ_ აი ეს საჭირო მოქმედება
1print(car)  car="mercedes"
1car="mercedes" print(car)
#ჩვენ ჯერ უნდა შევქმნათ ცვლადი და მერე უნდს დავპრინტოთ რაც ჩვენ პირიქით გავაკეთეთ ეს არის დიდი შეცდომა
2nd_sportsman="messi"  sportsman_2nd="messi"
#წინადადება შეიძლება დამთავრდეს რიცხვით მაგრამ არშეიძლება დაიწყოს რიცხვით სწორედ ამიტომ არის ერორი
1integer=14
#როგორც ჩვენ ვისწავლეთ intარის მთელი რიცხვი ჩვენ კიდევ გვიწერია ცვლადი ბრჭყალებში რაც არასწორია.ამიტომ გამოიტანა ერორი 
1string=5 string="GOA"
#სტრინგი არის ბრჭტალებში მოქცეული ცვლადი ჩვენ გვიწერია მთელი რიცხვი რაც იმას ნიშნავს რომ გვაქვს შეცდომა ანუ "ERORI"
age=14
height=1.55
print(age>height) print(height*age)
#იმისათვის რომ ჩვენი სასურველი რიცხვები ერთმანეთზე გადავამრავლოთ საჭიროა აი ამ მოქმედების გამოყენება(*) რაც ჩვენ არ გაგვიკეთებია სწორედ ამიტომ გვიჩვენებს ერორს
age=14
height=1.55
print(age/height)  print(age:height)
#განვიხილოთ ესეთი შემთხვევა როდესაც ჩვენ გვინდა სასურველი ცვლადის ერთმანეთზე გაყოფა ამისტვის ჩვენ უნდა გამოვიყენენოთ: აი ეს მოქმედება
location=tbilisi" location="tbilisi"
#როდესაც ჩვენ გვინდა შევქმათ string ტიპის ცვლადიცამისთვის საჭიროა ბრჭყალებში იყოს მოქცეული string ტიპის ცვლადი
SPORT="wrestling" sport="wrestling"
#ამ შემთხვევაში ერორი იმიტომ არის რომ ჩვენი ცვლადის სახელი აუცილებლად უნდა იწერებოდეს პატარა ასოებიტ ჩვენ კიდევ დიდი ასოებით გვიწერია რაც შესაბამისადდ გამოიტანს ერორს
city=(paris) city="paris"
print(paris) print(paris)
#ამ შემთხვევაშიც გამოიტანს ერორს იმიტომ რომ string ტიპის ცვლადის მნიშვნელობა აუცილებლად უნდა იყოს ბრჭყალებში და არა ფრჩხილებში
age=16
height=2.35
print(age@height)
#ამ შემთხვევაში როდესაც ჩვენ გვინდა სასურველ ცვლად ერთმანეთს  გამოვაკლოთ ამისსთვის საჭიროა - აი ამ გამოკლების ნიშანის გამოყენება
car="bmw"
model="m8"
print(car+model
#იმისათვის რომ ჩვენ დავპრინტოთ სასურველი ცვლადი საჭიროა მოვაქციოთ ფრჩხილებში ჩვენ გამოტოვებული გვაქვს სწორედ ამიტომ იქნება ერორი
bestakaemiaingeorgea="goa  besakademiaingeorgea="goa"
#აქ იმიტომ გამოიტანს ერორს რომ string ტიპის ცვლადს აუცილებლად უნდას ქონდეს ბრჭყალები ჩვენ გამოტოვებული გვაქვს რაც გამოიტანს ერორს
name="gio"  name="gio"
name="nika" surname="nika"
print(name+name)
#აქ აუცილებლად გამოიტანს ერორს იმიტომ რომ როდესაც ჩვენ გვინდა string ტიპის ცვლადის ერთმანეთისთვის მიმატება ცვლადის სახელი აუცილებლად უნდა განსხვავდებოდეს ერთმანეთისგან
surname="qareli"
name="giorgi"
print("surname+age") print(surname+age)
#როდესაც ჩვენ გვინდა string ტიპის ცვლადის დაპრინტვა აუცილებელი არაა რომ იყოს ბრჭყალებში მაგრამ აუცილებელია იყოს ფრჩხილებში
age="14" age=14
#მოდი კიდევ ერთხელ გავიმეოროთ რომ integer ტიპის ცვლადს არ სწირდება ბრჭყალები რადგან ის არის მთლი რივხვი
name=giorgi name="age"
#აქაც გავიხსენოთ რომ string ტიპის ცვლადს აუცილებლად შჭირდება ბრჭყალები