#შექმენით კალკულატორის ფუნქცია  რომელიც მომხმარებელს შეეკითხება ორ რიცხვს და მოქმედების ტიპს(მიმატება, გამოკლება, გამრავლება, გაყოფა) შესაბამისად ფუნქცია დააბრუნებს ანუ დაბეჭდავს შედეგს იმისდამიხედვით მომხმარებელს რა სურს და რა რიცხვები შემოიტანა, მაგალითად მომხმარებელმა თუ შემოიტანა 5 და 2 და ასევე მას სურს გამრავლება ფუნქციამ უნდა დააბრუნოს დაბეჭდოს შედეგად 2 * 5 ანუ 10

num_1 = int(input("enter first number:"))
num_2 = int(input("enter second number:"))  
math = int(input("არჩიეთ მოქმედება: 1 (მიმატება), 2 (გამოკლება), 3 (გამრავლება), 4 (გაყოფა)") )

if math == 1:
    print(num_1 + num_2)
elif math == 2:
    print(num_1 - num_2)

elif math == 3:
    print(num_1 * num_2)
else:
    print(num_1 // num_2)