#რა არის პი phyton პროგრამირებაში?
#phyton არის ერთ ერთი პროგრამირების ენა მაგალითად როგორც css,javaskripti,c++ და ასეშემდეგ

#რა არის turtle in phyton ში
#turtle in phyton ში არის როგორც ბიბლიოთკა

print("heloo world")
#ეს კოდი ტერმინალში გამოიტანს heloo world ს

print(True>False)
# ამ შემთხვევაში ეს კოდი ტერმინალში გამოიტანს trues რადგან false = 0 , true = 1 ეს ასეა ყოველთვის და რათქმაუნდა 1 მეტია 0 ამიტომ იქნება true

# რითი იქმნება phyton ში კომენტარი
# # აი ამ დიეზით იქმნება და იწერება კომენტარი

print( 15 // 4)
# ამ შემთხვევაში ეს კოდი გამოიტანს 3 იმიტომ რომ // ეს ორი ხაზი ნიშნავს თუ რამდენჯერ მოთავსდება 10 ში 4

x = 10
y = 4
print(x/y)
# ეს კოდი გამოიტანს 2.5 იმიტომ რომ, ერთი დახრილი ხაზი ნიშნავს ნაშთიან გაყოფას შესაბამისად იქნება 2.5


x = 10
y = "20"
print(x + y)
#ეს კოდი გამოიტანს ერორს იმიტომ რომ სტრინგი ინტეჯერს ვერანაირად ვერ მიემატება იმიტომ რომ integer = მთელ რიცხვს , ხოლო string = რაიმე სიტყვა ან წინადადება მაგალითდ "გოა საუკეთესოა"

x = 5
y = 2
print(5**2)
#ამ შემთხვევაში ეს კოდი გამოტანს 25 იმიტომ რომ, ორი ** ნიშნავს ახარისხებას

# if მუშაობს else გარეშე
#კი if მუშაობს else გარეშეც და else დახმარებითაც

# რით მთავრდება for loop
#for loop მთავრდება : აი ამით ორი წერტილით რომელსაც break ეწოდება

# რა იქნება თუ 10 % 3
# ამ შემთხვევაში ეს კოდი გამოიტანს 1 იმიტომ რომ პროცენტი გვიჩვენებს თუ რა დარჩება ნაშთი 10 ის 3 გაყოფისას

# integeri მრავლდება stringze 
# ამ შემთხვევაში integeris stringze გამრავლება შესაძლებელია

print(3>4 or 3>5 and 500<400 or 320>244)
# ამ სემთხვევაში ეს კოდი გამოიტანს true ს იმიტომ რომ or შემთხვევაში ყოველთვის გამოიტანს Trues გარდა ერთი შემთხვევისა როდესაც ორივე ელემენტი იქნება false,ხოლო and ის შემთხვევაში პირიქით ყოველთვის გამოიტანს False გარდა მაშინ როცა ორივე ელემენტი იქნება True

# რა არის list
# list არის სია ანუ array 

# რა არის ალგორითმი
# ალგორითმი არის  მოქმედების თნმიმდევრობით შესრულებული ანუ ნაბიჯ ნაბიჯ