# მომხმარებელს შემოატანინეთ ტესტში მიღებული ქულა, თუ ქულა მეტია 90 - ზე და ნაკლებია 100 - ზე მაგ შემთხვევაში დაპრინტეთ, თქვენ დაგიფინანსდებათ სწავლა. თუ მიღებული ქულა მეტია 70 - ზე და  ნაკლებია 80 - ზე მაგ შემთხვევაში დაპრინტეთ, თქვენ დაგიფინანსდებათ სწავლა 1500 ლარით, თუ მიღებული ქულა მეტია 40 -  ზე და ნაკლებია 70 - ზე მაგ შემთხვევაში დაპრინტეთ, თქვენ დაგიფინანსდებათ სწავლა 500 ლარტით, ხოლო თუ მიღებული ქულა ნაკლებია 40 ზე, მაგ შემტხვევაში დაპრინტეთ, ტქვენ არ დაგიფინანსდებათ სწავლის პროცეს

score = int(input("enter test score:"))

if score > 90 and score < 100:
    print("თქვენ დაგიფინანსდეათ სწავლა") 
elif score > 70  and score < 80:
    print("თქვენ დაგიფინანსდებათ სწავლა 1500 ლარით")
elif score > 40 and score < 70:
    print("თქვენ დაგიფინანსდებათ სწავლა 500 ლარით")
elif score < 40:
    print("თქვენ არ დაგიფინანსდებათ სწავლა")
else:
    print("შეიყვანე არასწორი ქულა")

print(score)