#მოსწავლეს შემოატანინეთ სკოლის ტესტში მიღებული ნიშანი, თუ ეს მიღებული ნიშანი უდრის 10 - ს, მაგ შემთხვევაში მასწავლებელმა, მშობელთან შეაქოს მოსწავლე, თუ მიღებული ნიშანი უდრის 8 -ს ან 9 - ს, მაგ შემთხვევაში, მასწავლებელმა, მშობელს პატარა შენიშვნა მისცეს. თუ მიღებული ქულა უდრის 5  - ს მაგ შემთხვევაში, მასწავლებელმა, მშობელს მისცეს შენიშვნა, ხოლო თუ მიღებული ნიშანი ნაკლებია 5 ზე, მაგ შემთხვევაში, მასწავლებელმა გააგდოს მოსწავლე სკოლიდან

test = int(input("რა მიიღე სჯოკის ტესტში"))
if test == 10 :
    print("თქქვენი შვილი ძალიან ჭკვიანი და ამავდროულად ძალიან ყოჩაღია")
if test == 8 and 9:
    print("თქვენი შვილი ზარმაცობს")
if test == 5:
    print("თვენი შვილი უდისციპლინო და ძალიან ხარმაცი")
if test == 5:
    print("თქვენი შვილი გარიცხულია სკოლიდან")
else:
    print("შეიყვანეთ სწორად ტესტში მიღებული ქულა")

